Repository: Synyster991/darkoont
Catalog: accounts/locale/*/LC_MESSAGES/django.po
Languages: mk

source: Log In
mk: Најави се

source: Username
mk: Корисничко име

source: Password
mk: Лозинка

source: Sign Up
mk: Пријави се

source: First Name
mk: Име

source: Last Name
mk: Презиме

source: Email
mk: Емаил адреса

source: Re-type Password
mk: Повтори лозинка

source: Student Version
mk: Студент

source: Pick a Class
mk: Одбери предмет

source: Teacher Version
mk: Професор

source: Teacher Code
mk: Код

source: Teacher Code is for teacher use only
mk: Кодот за професори е само во нивна употреба

source: Email this form
mk: Пратете ја оваа апликација

source: to filipdimi1999@gmail.com to get your section and Teacher Code for registration
mk: на filipdimi1999@gmail.com за потврда на опцијата професор и креирајте го вашиот ѕид

source: Use your code as verification
mk: Внесете го кодот за потврда

source: Create Profile
mk: Направи профил

source: See All My Grades
mk: Преглед на сите оценки

source: Section
mk: Предмет

source: Active Homework
mk: Домашни задачи во тек

source: Title
mk: Наслов

source: Max Points
mk: Максимални поени

source: Due Date
mk: Краен рок

source: Instructions
mk: Инструкции

source: Show Me
mk: Прикажи

source: is open-source learning management system. The Primary goal of Mr. Root is to help students and teachers to stay connected.
mk: е интернет платформа наменета за работа професор-ученик со цел да постои контакт на учениците со нивните професори со кој имаат можност на онлајн часови.

source: This version gives you
mk: Оваа опција овозможува

source: New videos every week
mk: Неделни видеа

source: New assignments to practice coding every week
mk: Неделни домашни задачи

source: Support
mk: поддршка

source: Graded assignments with feedback
mk: Оценета домашна работа со коментар (или Коментар и оцена за извршена домашна задача)

source: Make sure to register for this version before the starting date or you will be left behind. There are due dates so make sure to stay on track
mk: Регистирај се на Опцијата Ученик пред крајниот рок или во спротивно ќе заостанете со материјалот. Крајниот рок постои за да ја одржува вашата активност.

source: Public and Private sections
mk: Приватни и јавни часови

source: Create assignment droplets
mk: Можност на ученикот да прикачи докумени

source: Grade assignments
mk: Оценување на домашна работа

source: Create Assignment
mk: Креирај домашна задача

source: See Assignments
mk: Преглед на домашни задачи

source: Assignment
mk: Домашна задача

source: Submissions
mk: Објави

source: Students
mk: Студенти

source: See Student's Grades
mk: Преглед на оценки

source: Student Name
mk: Студент

source: Grades
mk: Оценки

source: Grade Student's Assignment
mk: Оцени домашната работа

source: Grade Submission
mk: Оцени домашна работа

source: Recent Submissions
mk: Неодамнешни објави

source: Full Name
mk: Име

source: Assignments (Click to Download)
mk: Задачи (Превземи со кликнување на насловот)

source: This username is taken!
mk: Зафатено корисничко име!

source: Your token is invalid!
mk: Погрешен професорски код!

source: Invalid password!
mk: Погрешна лозинка!

source: Username or password is incorrect!
mk: Погрешно корисничко име или погрешна лозинка!
