Repository: Synyster991/darkoont
Catalog: assignments/locale/*/LC_MESSAGES/django.po
Languages: mk

source: Creating Assignment
mk: Креирање на домашна работа

source: Title
mk: Наслов

source: Pick a Section
mk: Одбери предмет

source: Due Date
mk: Краен рок

source: Max Points
mk: Максимални поени

source: Source Link
mk: Материјал (внесете линк)

source: Document
mk: Документ

source: Instructions
mk: Инструкции

source: Create Homework
mk: Задавање домашна задача

source: Issued by
mk: Проф.

source: Watch Tutorial
mk: Преглед на упатство

source: Download Assignment
mk: Преземи домашна задача

source: Submit
mk: Објави

source: Submitted
mk: Објавено

source: Student
mk: Студент

source: Section
mk: Предмет

source: Score
mk: Поени

source: ID
mk: ИД

source: Assignment (Click to Download)
mk: Задачи (Превземи со кликнување на насловот)

source: Points
mk: Поени

source: Grades For
mk: Ученик

source: Average Score
mk: Просек

source: Assignment Name
mk: Домашна работа

source: Assignment
mk: Домашна работа

source: Full Name
mk: Име

source: Grade
mk: Оценка

source: All fields are required!
mk: Сите полиња се задолжителни!

source: All fields are required
mk: Сите полиња се задолжителни

source: Assignment is not Submitted! Please Try again.
mk: Домашната работа не е објавена! Ве молиме обидете се повторно.

source: Student not found!
mk: Студентот не е запишан на тој предмет!

source: Assignment is not ready to be graded!
mk: Домашната работа не е готова за да биде оценета!

source: Submissions not found
mk: Објавите не се пронајдени

source: Section not found!
mk: Предметот не е пронајден.
